cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/versions'

brew 'awscli'
brew 'bash-completion'
brew 'chromedriver'
brew 'gawk'
brew 'git'
brew 'go'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'mysql'
brew 'node'
brew 'opam'
brew 'openssl'
brew 'phantomjs'
brew 'pipenv'
brew 'pyenv'
brew 'rbenv'
brew 'ruby'
brew 'ruby-build'
brew 'tmux'
brew 'wget'
brew 'yarn', args: ['without-node']

cask 'iterm2'
cask 'java'
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'sequel-pro'
cask 'spotify'
cask 'virtualbox'
cask 'visual-studio-code'

cask 'font-anonymice-powerline'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-monofur-for-powerline'
cask 'font-noto-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu-mono-derivative-powerline'
