cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-core'

brew 'awscli'
brew 'bash-completion'
brew 'gawk'
brew 'git'
brew 'go'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'node'
brew 'openssl'
brew 'pipenv'
brew 'pyenv'
brew 'rbenv'
brew 'ruby'
brew 'ruby-build'
brew 'svn'
brew 'tmux'
brew 'watchman'
brew 'wget'

cask '1password'
cask 'beekeeper-studio'
cask 'iterm2'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'postman'
cask 'monitorcontrol'
cask 'rectangle'
cask 'sequel-pro'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'

cask 'font-hack'
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-sf-mono'
cask 'font-anonymice-powerline'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-monofur-for-powerline'
cask 'font-noto-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu-mono-derivative-powerline'
