cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'dart-lang/dart'
tap 'homebrew/bundle'
tap 'homebrew/versions'

brew 'awscli'
brew 'bash-completion'
brew 'chromedriver'
brew 'dart', args: ['with-content-shell', 'with-dartium']
brew 'gawk'
brew 'git'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'mysql'
brew 'node'
brew 'opam'
brew 'openssl'
brew 'phantomjs'
brew 'python'
brew 'pyenv'
brew 'rbenv'
brew 'ruby'
brew 'ruby-build'
brew 'wget'

cask 'java'
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'sequel-pro'
cask 'spotify'
cask 'virtualbox'
cask 'visual-studio-code'
